var strs = [
    "长颈鹿1955 被套单件：150×200cm 1",
    "801 被套单件：180×220 2",
    "031 被套单件：200×230cm 3",
    "462百花丛中 被套单件：200×230cm 4",
    "019 被套单件：200×230cm 5",
    "简约至上002 被套单件：180×220 6",
    "甜蜜花香1760 被套单件：180×220 7",
    "462百花丛中 被套单件：150×200cm 8",
    "878猫猫乐园 被套单件：200×230cm 9",
    "801 被套单件：150×200cm 10",
    "长颈鹿1955 被套单件：200×230cm 11",
    "记忆时间2023 被套单件：200×230cm 12",
    "摩登风情1975 被套单件：200×230cm 13",
    "245 被套单件：200×230cm 14",
    "长颈鹿1955 被套单件：180×220 15",
    "783 被套单件：200×230cm 16"
];

var nums = [
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    "10",
    "11",
    "12",
    "13",
    "14",
    "15"
];

strs = strs.sort((a, b) => {
    return a.localeCompare(b);
});

nums = nums.sort((a, b) => {
    return a.localeCompare(b);
});

console.log(strs, nums);
